# FabricationDuctworkStiffenerSpec Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationDuctworkStiffenerSpec Property
ParameterTypeId Class See Also
---
"Stiffener Specification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationDuctworkStiffenerSpec { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationDuctworkStiffenerSpec As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationDuctworkStiffenerSpec {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace